app/controllers/products_controller.rb

  def index
    @products = Product.all.order("name")
---
SELECT "products".* FROM "products" ORDER BY name

  def create
    @product = Product.new
    @product.name = params[:product][:name]
    @product.description = params[:product][:description]
    @product.price = params[:product][:price]
    @product.img_url = params[:product][:img_url]

    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "car"], ["description", "drives fast"], ["price", 2], ["img_url", "www.cnn.com"], ["created_at", "2018-01-22 13:59:19.030383"], ["updated_at", "2018-01-22 13:59:19.030383"]]