app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "the best"], ["product_id", 1], ["created_at", "2018-01-22 13:59:43.733690"], ["updated_at", "2018-01-22 13:59:43.733690"]]
---
  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.new
    @review.comment = params[:review][:comment]

    if @review.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ? AND "reviews"."id" = ? LIMIT ?  [["product_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @product = Product.find(params[:product_id])
    @review = @product.reviews.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "best price and value"], ["updated_at", "2018-01-22 14:00:21.575316"], ["id", 1]]
---
  def update
    @review = Review.find(params[:id])

    @review.comment = params[:review][:comment]

    if @review.save